auto-cpufreq
betterlockscreen
catppuccin-cursors-latte
catppuccin-cursors-mocha
catppuccin-gtk-theme-latte
catppuccin-gtk-theme-mocha
colorpicker-ym1234-git
downgrade
hledger-bin
hledger-web-bin
localsend-bin
ncurses5-compat-libs
onedrive-abraunegg
paru-bin
tela-icon-theme-bin
ttf-apple-emoji
ungoogled-chromium-bin
vial-appimage
vscodium-bin
webtorrent-cli
xfwm4-gaps
zen-browser-bin
