tap "cormacrelf/tap"
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "nextdns/tap"
tap "osx-cross/arm", trusted: true
tap "osx-cross/avr", trusted: true
tap "qmk/qmk", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Debugger for the Go programming language
brew "delve"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Deep clean and optimize your Mac
brew "mole"
# Remote terminal application
brew "mosh"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# SMART hard drive monitoring
brew "smartmontools"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify", trusted: true
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns", trusted: true
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk", trusted: true
# Display management tool
cask "betterdisplay"
# Fastest file searching tool
cask "cardinal-search"
# Developer platform
cask "dotnet-sdk"
# Developer platform
cask "dotnet-sdk@8"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-inter"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Offline AI chat tool
cask "jan"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Customise mouse behavior
cask "linearmouse"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Utility to extend trackpad functionality
cask "middleclick"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Remote management solution
cask "royal-tsx"
# Real time file synchronisation software
cask "syncthing-app"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Menu bar manager
cask "thaw"
# Customizable email client
cask "thunderbird"
# Open-source BitTorrent client
cask "transmission"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
