tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "bat"
brew "btop"
brew "chezmoi"
brew "delve"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "helix"
brew "hledger"
brew "python@3.13"
brew "ripgrep"
brew "rustup"
brew "tealdeer"
brew "uv"
brew "yazi"
brew "qmk/qmk/qmk"
cask "betterdisplay"
cask "cardinal-search"
cask "font-fira-code-nerd-font"
cask "font-inter"
cask "iina"
cask "keepassxc"
cask "keka"
cask "keyboardcleantool"
cask "kitty"
cask "lm-studio"
cask "localsend"
cask "obsidian"
cask "onedrive"
cask "rectangle"
cask "scroll-reverser"
cask "syncthing-app"
cask "visual-studio-code"
cask "zen"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "rust-lang.rust-analyzer"
