tap "charmbracelet/tap"
tap "cormacrelf/tap"
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "bat"
brew "btop"
brew "chezmoi"
brew "delve"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "gopls"
brew "helix"
brew "hledger"
brew "mole"
brew "mosh"
brew "python@3.13"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "smartmontools"
brew "tealdeer"
brew "typst"
brew "uv"
brew "yazi"
brew "yt-dlp"
brew "charmbracelet/tap/crush"
brew "cormacrelf/tap/dark-notify"
brew "jundot/omlx/omlx", args: ["with-grammar"]
brew "qmk/qmk/qmk"
cask "betterdisplay"
cask "cardinal-search"
cask "dotnet-sdk"
cask "dotnet-sdk@8"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-inter"
cask "helium-browser"
cask "iina"
cask "keepassxc"
cask "keka"
cask "keyboardcleantool"
cask "kitty"
cask "linearmouse"
cask "localsend"
cask "middleclick"
cask "obsidian"
cask "onedrive"
cask "pearcleaner"
cask "rectangle"
cask "royal-tsx"
cask "syncthing-app"
cask "thaw"
cask "thunderbird"
cask "transmission"
cask "visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "mhutchie.git-graph"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "patrickt.hledger-lsp-vscode"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "vadimcn.vscode-lldb"
go "golang.org/x/tools/gopls"
