auto-cpufreq
brother-dcp-l2550dw
btdu-bin
catppuccin-cursors-latte
catppuccin-cursors-mocha
catppuccin-gtk-theme-latte
catppuccin-gtk-theme-mocha
downgrade
hledger-bin
llama.cpp
localsend-bin
onedrive-abraunegg
paru
tela-icon-theme
ttf-apple-emoji
ungoogled-chromium-bin
vscodium-bin
webtorrent-cli
xfwm4-gaps
zen-browser-bin
